<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>

추가할 내용 - 카테고리 삭제시 해당 카테고리의 제품 전체삭제 기능 @@@@@@
			- 제품 수정시 카테고리 변경도 가능하게.. select로 

시간있으면 할 내용 - 좋아요, 댓글


공통   - 메인화면 O
		 로그인, 회원가입 폼 O
		 회원가입시 아이디 중복확인 추가하기 @@@@@@@@@@@@@@@@@
		 샵, 상품 상세보기 폼 O
		 
		 페이징 @@@@@@@@@@@@@@@@@
		 검색	@@@@@@@@@@@@@@@@@


사용자 - 장바구니 폼 
		 장바구니 구매 처리 
		 구매하기 폼(구매시 배송지 정보 기입) 
		 개인정보 수정 폼 
		 구매내역 폼 


관리자 - 카테고리 전체보기 O
		 카테고리별 제품보기 O
		 
		 카테고리 등록 폼 O
		 제품 등록 폼 O
		 
		 카테고리 수정 O
		 제품 수정 폼 O
		 
		 제품 카테고리 삭제 O
		 제품 삭제 O
		 
		 회원 정보 전체보기 폼??
		 회원 주문내역??
		 
		 
